In [49]:
import pandas as pd 
import numpy as np
import openpyxl as xl
import sklearn as sk
import scipy as sp

In [19]:
xls = pd.ExcelFile("Data1.xlsx")
df = xls.parse("Sheet1")

In [20]:
df = pd.read_excel("Data1.xlsx" , sheet_name="Sheet1" ,engine="openpyxl")

Overview OF DATA

In [21]:
df.head()

,Customer_ID,Age,Income,Credit_Score,Credit_Utilization,Missed_Payments,Delinquent_Account,Loan_Balance,Debt_to_Income_Ratio,Employment_Status,Account_Tenure,Credit_Card_Type,Location,Month_1,Month_2,Month_3,Month_4,Month_5,Month_6
0,CUST0001,56,165580.0,398.0,0.390502,3,0,16310.0,0.317396,EMP,18,Student,Los Angeles,Late,Late,Missed,Late,Missed,Late
1,CUST0002,69,100999.0,493.0,0.312444,6,1,17401.0,0.196093,Self-employed,0,Standard,Phoenix,Missed,Missed,Late,Missed,On-time,On-time
2,CUST0003,46,188416.0,500.0,0.359930,0,0,13761.0,0.301655,Self-employed,1,Platinum,Chicago,Missed,Late,Late,On-time,Missed,Late
3,CUST0004,32,101672.0,413.0,0.371400,3,0,88778.0,0.264794,Unemployed,15,Platinum,Phoenix,Late,Missed,Late,Missed,Late,Late
4,CUST0005,60,38524.0,487.0,0.234716,2,0,13316.0,0.510583,Self-employed,11,Standard,Phoenix,Missed,On-time,Missed,Late,Late,Late

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 19 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Customer_ID           500 non-null    object
 1   Age                   500 non-null    int64
 2   Income                461 non-null    float64
 3   Credit_Score          498 non-null    float64
 4   Credit_Utilization    500 non-null    float64
 5   Missed_Payments       500 non-null    int64
 6   Delinquent_Account    500 non-null    int64
 7   Loan_Balance          471 non-null    float64
 8   Debt_to_Income_Ratio  500 non-null    float64
 9   Employment_Status     500 non-null    object
 10  Account_Tenure        500 non-null    int64
 11  Credit_Card_Type      500 non-null    object
 12  Location              500 non-null    object
 13  Month_1               500 non-null    object
 14  Month_2               500 non-null    object
 15  Month_3               500 non-null    object
 16  Month_4               500 non-null    object
 17  Month_5               500 non-null    object
 18  Month_6               500 non-null    object
dtypes: float64(5), int64(4), object(10)
memory usage: 74.3+ KB

In [23]:
df.describe()

,Age,Income,Credit_Score,Credit_Utilization,Missed_Payments,Delinquent_Account,Loan_Balance,Debt_to_Income_Ratio,Account_Tenure
count,500.000000,461.000000,498.000000,500.000000,500.000000,500.000000,471.000000,500.000000,500.000000
mean,46.266000,108379.893709,577.716867,0.491446,2.968000,0.160000,48654.428875,0.298862,9.740000
std,16.187629,53662.723741,168.881211,0.197103,1.946935,0.366973,29395.537273,0.094521,5.923054
min,18.000000,15404.000000,301.000000,0.050000,0.000000,0.000000,612.000000,0.100000,0.000000
25%,33.000000,62295.000000,418.250000,0.356486,1.000000,0.000000,23716.500000,0.233639,5.000000
50%,46.500000,107658.000000,586.000000,0.485636,3.000000,0.000000,45776.000000,0.301634,10.000000
75%,59.250000,155734.000000,727.250000,0.634440,5.000000,0.000000,75546.500000,0.362737,15.000000
max,74.000000,199943.000000,847.000000,1.025843,6.000000,1.000000,99620.000000,0.552956,19.000000

Finding the Null Values and Location

In [24]:
df.isnull().sum()

Customer_ID              0
Age                      0
Income                  39
Credit_Score             2
Credit_Utilization       0
Missed_Payments          0
Delinquent_Account       0
Loan_Balance            29
Debt_to_Income_Ratio     0
Employment_Status        0
Account_Tenure           0
Credit_Card_Type         0
Location                 0
Month_1                  0
Month_2                  0
Month_3                  0
Month_4                  0
Month_5                  0
Month_6                  0
dtype: int64

In [25]:
df.isnull().stack()[df.isnull().stack() == True].index

MultiIndex([(  8, 'Loan_Balance'),
            ( 23, 'Loan_Balance'),
            ( 25, 'Loan_Balance'),
            ( 28, 'Loan_Balance'),
            ( 40,       'Income'),
            ( 42,       'Income'),
            ( 45, 'Loan_Balance'),
            ( 51, 'Loan_Balance'),
            ( 52, 'Loan_Balance'),
            ( 59,       'Income'),
            ( 66,       'Income'),
            ( 68,       'Income'),
            ( 76,       'Income'),
            ( 93,       'Income'),
            (102, 'Loan_Balance'),
            (104, 'Loan_Balance'),
            (113,       'Income'),
            (115, 'Credit_Score'),
            (115, 'Loan_Balance'),
            (120, 'Loan_Balance'),
            (124, 'Loan_Balance'),
            (144,       'Income'),
            (153,       'Income'),
            (164, 'Loan_Balance'),
            (177, 'Loan_Balance'),
            (187,       'Income'),
            (191, 'Loan_Balance'),
            (195, 'Loan_Balance'),
            (208,       'Income'),
            (208, 'Loan_Balance'),
            (224,       'Income'),
            (228,       'Income'),
            (243, 'Loan_Balance'),
            (272,       'Income'),
            (272, 'Loan_Balance'),
            (276,       'Income'),
            (278,       'Income'),
            (281, 'Loan_Balance'),
            (290,       'Income'),
            (293,       'Income'),
            (298,       'Income'),
            (299,       'Income'),
            (307,       'Income'),
            (342, 'Loan_Balance'),
            (369,       'Income'),
            (370,       'Income'),
            (375,       'Income'),
            (376,       'Income'),
            (378,       'Income'),
            (378, 'Credit_Score'),
            (386,       'Income'),
            (393,       'Income'),
            (395, 'Loan_Balance'),
            (407,       'Income'),
            (412, 'Loan_Balance'),
            (418,       'Income'),
            (437,       'Income'),
            (439, 'Loan_Balance'),
            (450,       'Income'),
            (453, 'Loan_Balance'),
            (458,       'Income'),
            (459, 'Loan_Balance'),
            (463,       'Income'),
            (465,       'Income'),
            (465, 'Loan_Balance'),
            (473,       'Income'),
            (481, 'Loan_Balance'),
            (482,       'Income'),
            (482, 'Loan_Balance'),
            (494,       'Income')],
           )

In [26]:
df.describe()

,Age,Income,Credit_Score,Credit_Utilization,Missed_Payments,Delinquent_Account,Loan_Balance,Debt_to_Income_Ratio,Account_Tenure
count,500.000000,461.000000,498.000000,500.000000,500.000000,500.000000,471.000000,500.000000,500.000000
mean,46.266000,108379.893709,577.716867,0.491446,2.968000,0.160000,48654.428875,0.298862,9.740000
std,16.187629,53662.723741,168.881211,0.197103,1.946935,0.366973,29395.537273,0.094521,5.923054
min,18.000000,15404.000000,301.000000,0.050000,0.000000,0.000000,612.000000,0.100000,0.000000
25%,33.000000,62295.000000,418.250000,0.356486,1.000000,0.000000,23716.500000,0.233639,5.000000
50%,46.500000,107658.000000,586.000000,0.485636,3.000000,0.000000,45776.000000,0.301634,10.000000
75%,59.250000,155734.000000,727.250000,0.634440,5.000000,0.000000,75546.500000,0.362737,15.000000
max,74.000000,199943.000000,847.000000,1.025843,6.000000,1.000000,99620.000000,0.552956,19.000000

In [29]:
df.Income.unique()

array([165580., 100999., 188416., 101672.,  38524.,  84042.,  35056.,
       123215.,  66991.,  34870.,  42532.,  70479.,  56975., 117023.,
       143148., 159356., 146484., 183152.,  81040., 181319., 199402.,
        40351., 154487., 108468.,  41646., 193998.,  89740., 136790.,
        86726.,  88523.,  72458.,  60106., 106362.,  99076.,  69693.,
       137402.,  53756.,  97750.,     nan,  81617., 106267.,  59238.,
       153311., 146800., 118033., 169865., 109074., 185806., 194819.,
        90353., 198401.,  76629., 107193., 140899., 184160., 155507.,
        43251., 117634., 172164., 196415., 159572., 136465.,  36447.,
       159188., 181267.,  59425.,  97844., 115235., 189358.,  88847.,
       172504., 186230.,  80215., 141131., 129585., 127856.,  18709.,
       121357., 152326., 189197.,  54298., 106007., 155734., 163216.,
       107658., 178165., 127816.,  19748., 170026.,  43732.,  16015.,
       138961., 121884.,  19835.,  84724., 125448., 134156., 190333.,
       125226.,  80953., 129692.,  90880., 118081., 115497., 166836.,
       187627.,  73141., 180983., 168772.,  16252., 118333., 192247.,
       199294., 129548.,  58088.,  30485.,  77292.,  41790.,  31364.,
        15404.,  32955.,  53513.,  97986., 116570., 119185.,  21801.,
        54081.,  74494., 117795.,  21970., 185883., 150230.,  38959.,
       101188.,  47217.,  76476., 108610., 182280., 149415., 120616.,
       199943., 178551.,  68932.,  23702.,  67528., 162851., 183513.,
        42192.,  32019.,  67638., 153429., 141020.,  69098.,  62295.,
       164143., 143778., 166456., 165159.,  40934.,  84836., 191517.,
        38289.,  72108., 187312., 146456.,  52131.,  88963.,  20569.,
       150683., 191615.,  70284.,  85390.,  74101., 178273.,  61540.,
       170576., 114657.,  76813.,  48307., 193677., 186334.,  74163.,
       102235.,  27763.,  39285.,  98042., 116042.,  95219., 109456.,
        93752.,  42350., 142016.,  16062.,  75692., 158087.,  53765.,
       198062.,  38049., 166222., 193031.,  54749.,  65990.,  68682.,
        38061.,  81234., 119573.,  53494.,  90697., 176426., 194208.,
       120891.,  33017.,  70393., 193352., 179506.,  26174.,  85640.,
       120570.,  18267., 112007.,  99665., 167424.,  98613.,  52744.,
        36677., 180421.,  21949.,  59811.,  28807., 101900., 109297.,
        53304., 173427., 140917.,  96317.,  93832.,  31896.,  72043.,
        57318., 161377., 167617.,  71570., 130359.,  58919., 126888.,
        73243., 104588., 129821.,  25916., 127566.,  33888., 152162.,
        51187., 108396.,  65612.,  75566., 177993., 134180.,  64922.,
        24435., 155932., 169786.,  87474.,  59482., 147396., 188420.,
       153877.,  54954., 168487.,  86180., 105852.,  40945.])

In [ ]:
df_withincome = df.Income[df.Income.notnull()]
df_withoutIncome = df.Income[df.Income.isnull()]